import { defineAvatarMeta, DmgAttrKeysEnum, DmgTalentKeysEnum, ElementEnum, type BuffCheckArgs } from '@/core/panel'
import { WeaponTypeEnum } from '@/core/panel/types/Weapon'

export const _10000002 = defineAvatarMeta(
  {
    id: '10000002',
    elements: {
      [ElementEnum.冰]: {
        name: '神里绫华',
        abbr: '绫华',
        star: 5,
        weapon: WeaponTypeEnum.单手剑,
        element: ElementEnum.冰,
        basic: {
          title: '白鹭霜华',
          allegiance: '社奉行',
          birth: '9-28',
          astro: '雪鹤座',
          desc: '稻妻「社奉行」神里家的大小姐。端庄而文雅，聪慧又坚韧。',
          cncv: '小N'
        },
        materials: {
          gem: '哀叙冰玉',
          boss: '恒常机关之心',
          specialty: '绯樱绣球',
          normal: '名刀镡',
          talent: '「风雅」的哲学',
          weekly: '血玉之枝'
        },
        costumes: ['200201'],
        attr: {
          base: {
            [DmgAttrKeysEnum.hp]: 13772,
            [DmgAttrKeysEnum.atk]: 418.98,
            [DmgAttrKeysEnum.def]: 839.64
          },
          grow: {
            key: DmgAttrKeysEnum.cdmg, value: 38.4
          },
          details: {
            1: [957, 25.29, 58.94, 0],
            20: [2460, 64.96, 151.42, 0],
            '20+': [3175, 83.85, 195.45, 0],
            40: [4755, 125.6, 292.77, 0],
            '40+': [5264, 139.03, 324.05, 6],
            50: [6054, 159.91, 372.74, 6],
            '50+': [6732, 177.81, 414.45, 12],
            60: [7523, 198.7, 463.14, 12],
            '60+': [8031, 212.12, 494.43, 12],
            70: [8821, 232.98, 543.05, 12],
            '70+': [9329, 246.41, 574.34, 18],
            80: [10120, 267.29, 623.03, 18],
            '80+': [10628, 280.72, 654.31, 24],
            90: [11419, 301.6, 703, 24],
            '90+': [11419, 301.6, 703, 24],
            100: [12209, 378.55, 751.62, 24]
          }
        },
        talentId: {
          10018: DmgTalentKeysEnum.a,
          10019: DmgTalentKeysEnum.e,
          10024: DmgTalentKeysEnum.q
        },
        talentCons: {
          [DmgTalentKeysEnum.e]: 5,
          [DmgTalentKeysEnum.q]: 3
        },
        talent: {
          [DmgTalentKeysEnum.a]: {
            id: '231',
            name: '神里流·倾',
            desc: ['<h3>普通攻击</h3>', '进行至多五段的连续剑击。', '<h3>重击</h3>', '消耗一定体力，在居合中放出连续的剑风。', '<h3>下落攻击</h3>', '从空中下坠冲击地面，攻击下落路径上的敌人，并在落地时造成范围伤害。'],
            tables: [
              { name: '一段伤害', unit: '', isSame: false, values: ['45.73%', '49.45%', '53.17%', '58.49%', '62.21%', '66.46%', '72.31%', '78.16%', '84.01%', '90.39%', '96.77%', '103.15%', '109.53%', '115.91%', '122.29%'] },
              { name: '二段伤害', unit: '', isSame: false, values: ['48.68%', '52.65%', '56.61%', '62.27%', '66.23%', '70.76%', '76.99%', '83.22%', '89.44%', '96.24%', '103.03%', '109.82%', '116.62%', '123.41%', '130.2%'] },
              { name: '三段伤害', unit: '', isSame: false, values: ['62.62%', '67.72%', '72.82%', '80.1%', '85.19%', '91.02%', '99.03%', '107.04%', '115.05%', '123.79%', '132.53%', '141.26%', '150%', '158.74%', '167.48%'] },
              { name: '四段伤害', unit: '', isSame: false, values: ['22.65%*3', '24.49%*3', '26.33%*3', '28.97%*3', '30.81%*3', '32.92%*3', '35.81%*3', '38.71%*3', '41.61%*3', '44.77%*3', '47.93%*3', '51.09%*3', '54.25%*3', '57.41%*3', '60.57%*3'] },
              { name: '五段伤害', unit: '', isSame: false, values: ['78.18%', '84.55%', '90.91%', '100%', '106.36%', '113.64%', '123.64%', '133.64%', '143.64%', '154.55%', '165.45%', '176.36%', '187.27%', '198.18%', '209.09%'] },
              { name: '重击伤害', unit: '', isSame: false, values: ['55.13%*3', '59.61%*3', '64.1%*3', '70.51%*3', '75%*3', '80.12%*3', '87.18%*3', '94.23%*3', '101.28%*3', '108.97%*3', '116.66%*3', '124.35%*3', '132.05%*3', '139.74%*3', '147.43%*3'] },
              { name: '重击体力消耗', unit: '', isSame: true, values: Array(15).fill('20点') },
              { name: '下坠期间伤害', unit: '', isSame: false, values: ['63.93%', '69.14%', '74.34%', '81.77%', '86.98%', '92.93%', '101.1%', '109.28%', '117.46%', '126.38%', '135.3%', '144.22%', '153.14%', '162.06%', '170.98%'] },
              { name: '低空/高空坠地冲击伤害', unit: '', isSame: false, values: ['127.84% / 159.68%', '138.24% / 172.67%', '148.65% / 185.67%', '163.51% / 204.24%', '173.92% / 217.23%', '185.81% / 232.09%', '202.16% / 252.51%', '218.51% / 272.93%', '234.86% / 293.36%', '252.7% / 315.64%', '270.54% / 337.92%', '288.38% / 360.2%', '306.22% / 382.48%', '324.05% / 404.76%', '341.89% / 427.04%'] }
            ]
          },
          [DmgTalentKeysEnum.e]: {
            id: '232',
            name: '神里流·冰华',
            desc: ['唤起盛开的冰之华，击飞身边的敌人并造成冰元素范围伤害。', '<i>「晴云胧月夜，妄执如雾，心野凄迷恋羁旅。」</i>'],
            tables: [
              { name: '技能伤害', unit: '', isSame: false, values: ['239.2%', '257.14%', '275.08%', '299%', '316.94%', '334.88%', '358.8%', '382.72%', '406.64%', '430.56%', '454.48%', '478.4%', '508.3%', '538.2%', '568.1%'] },
              { name: '冷却时间', unit: '', isSame: true, values: Array(15).fill('10秒') }
            ]
          },
          [DmgTalentKeysEnum.q]: {
            id: '239',
            name: '神里流·霜灭',
            desc: ['以倾奇之姿汇聚寒霜，放出持续行进的霜见雪关扉。', '<h3>霜见雪关扉</h3>', '·以刀锋般尖锐的霜风持续切割触及的敌人，造成冰元素伤害；', '·持续时间结束时绽放，造成冰元素范围伤害。', '<i>「吹雪濡鹭时，积思若霜，胸底思重焉哀怜。」</i>'],
            tables: [
              { name: '切割伤害', unit: '', isSame: false, values: ['112.3%', '120.72%', '129.15%', '140.37%', '148.8%', '157.22%', '168.45%', '179.68%', '190.91%', '202.14%', '213.37%', '224.6%', '238.64%', '252.68%', '266.71%'] },
              { name: '绽放伤害', unit: '', isSame: false, values: ['168.45%', '181.08%', '193.72%', '210.56%', '223.2%', '235.83%', '252.68%', '269.52%', '286.37%', '303.21%', '320.06%', '336.9%', '357.96%', '379.01%', '400.07%'] },
              { name: '持续时间', unit: '', isSame: true, values: Array(15).fill('5秒') },
              { name: '冷却时间', unit: '', isSame: true, values: Array(15).fill('20秒') },
              { name: '元素能量', unit: '', isSame: true, values: Array(15).fill('80') }
            ]
          }
        },
        talentData: {
          [DmgTalentKeysEnum.a]: {
            一段伤害: [45.73, 49.45, 53.17, 58.49, 62.21, 66.46, 72.31, 78.16, 84.01, 90.39, 96.77, 103.15, 109.53, 115.91, 122.29],
            二段伤害: [48.68, 52.65, 56.61, 62.27, 66.23, 70.76, 76.99, 83.22, 89.44, 96.24, 103.03, 109.82, 116.62, 123.41, 130.2],
            三段伤害: [62.62, 67.72, 72.82, 80.1, 85.19, 91.02, 99.03, 107.04, 115.05, 123.79, 132.53, 141.26, 150, 158.74, 167.48],
            四段伤害: [67.94999999999999, 73.47, 78.99, 86.91, 92.42999999999999, 98.76, 107.43, 116.13, 124.83, 134.31, 143.79, 153.27, 162.75, 172.23, 181.71],
            四段伤害2: [[22.65, 3], [24.49, 3], [26.33, 3], [28.97, 3], [30.81, 3], [32.92, 3], [35.81, 3], [38.71, 3], [41.61, 3], [44.77, 3], [47.93, 3], [51.09, 3], [54.25, 3], [57.41, 3], [60.57, 3]],
            五段伤害: [78.18, 84.55, 90.91, 100, 106.36, 113.64, 123.64, 133.64, 143.64, 154.55, 165.45, 176.36, 187.27, 198.18, 209.09],
            重击伤害: [165.39000000000001, 178.82999999999998, 192.29999999999998, 211.53000000000003, 225, 240.36, 261.54, 282.69, 303.84000000000003, 326.90999999999997, 349.98, 373.04999999999995, 396.15000000000003, 419.22, 442.29],
            重击伤害2: [[55.13, 3], [59.61, 3], [64.1, 3], [70.51, 3], [75, 3], [80.12, 3], [87.18, 3], [94.23, 3], [101.28, 3], [108.97, 3], [116.66, 3], [124.35, 3], [132.05, 3], [139.74, 3], [147.43, 3]],
            下坠期间伤害: [63.93, 69.14, 74.34, 81.77, 86.98, 92.93, 101.1, 109.28, 117.46, 126.38, 135.3, 144.22, 153.14, 162.06, 170.98],
            '低空/高空坠地冲击伤害': [[127.84, 159.68], [138.24, 172.67], [148.65, 185.67], [163.51, 204.24], [173.92, 217.23], [185.81, 232.09], [202.16, 252.51], [218.51, 272.93], [234.86, 293.36], [252.7, 315.64], [270.54, 337.92], [288.38, 360.2], [306.22, 382.48], [324.05, 404.76], [341.89, 427.04]],
            '低空/高空坠地冲击伤害2': [[127.84, 159.68], [138.24, 172.67], [148.65, 185.67], [163.51, 204.24], [173.92, 217.23], [185.81, 232.09], [202.16, 252.51], [218.51, 272.93], [234.86, 293.36], [252.7, 315.64], [270.54, 337.92], [288.38, 360.2], [306.22, 382.48], [324.05, 404.76], [341.89, 427.04]]
          },
          [DmgTalentKeysEnum.e]: {
            技能伤害: [239.2, 257.14, 275.08, 299, 316.94, 334.88, 358.8, 382.72, 406.64, 430.56, 454.48, 478.4, 508.3, 538.2, 568.1]
          },
          [DmgTalentKeysEnum.q]: {
            切割伤害: [112.3, 120.72, 129.15, 140.37, 148.8, 157.22, 168.45, 179.68, 190.91, 202.14, 213.37, 224.6, 238.64, 252.68, 266.71],
            绽放伤害: [168.45, 181.08, 193.72, 210.56, 223.2, 235.83, 252.68, 269.52, 286.37, 303.21, 320.06, 336.9, 357.96, 379.01, 400.07]
          }
        },
        cons: [
          {
            name: '霜杀墨染樱',
            desc: [
              '神里绫华的普通攻击或重击对敌人造成冰元素伤害时，有50%的几率使神里流·冰华的冷却时间缩减0.3秒。该效果每0.1秒只能触发一次。'
            ]
          }, {
            name: '三重雪关扉',
            desc: [
              '施放神里流·霜灭时，会额外释放两股规模较小的霜见雪关扉，各自能造成原本20%的伤害。'
            ]
          }, {
            name: '花白锦画纸吹雪',
            desc: [
              '神里流·霜灭的技能等级提高3级。',
              '至多提升至15级。'
            ]
          }, {
            name: '盈缺流返',
            desc: [
              '敌人受到神里流·霜灭的霜见雪关扉造成的伤害后，防御力降低30%，持续6秒。'
            ]
          }, {
            name: '花云钟入月',
            desc: [
              '神里流·冰华的技能等级提高3级。',
              '至多提升至15级。'
            ]
          }, {
            name: '间水月',
            desc: [
              '每过10秒，神里绫华会获得「薄冰舞踏」，使重击造成的伤害提高298%。薄冰舞踏效果将在重击命中敌人的0.5秒后清除，并重新开始计算时间。'
            ]
          }
        ],
        passive: [
          {
            name: '鉴查心得',
            desc: [
              '合成武器突破素材时，有10%概率获得2倍产出。'
            ]
          }, {
            name: '天罪国罪镇词',
            desc: [
              '施放神里流·冰华后的6秒内，神里绫华的普通攻击与重击造成的伤害提升30%。'
            ]
          }, {
            name: '寒天宣命祝词',
            desc: [
              '神里流·霰步结束时释放的寒冰命中了敌人时，神里绫华将获得如下效果：',
              '·恢复10点体力；',
              '·获得18%冰元素伤害加成，持续10秒。'
            ]
          }, {
            id: '233',
            name: '神里流·霰步',
            desc: [
              '<h3>替代冲刺</h3>',
              '隐入碎冰，以消耗体力为代价，化为激流快速移动。',
              '在霰步状态下，神里绫华可以在水面上高速移动。',
              '结束霰步现身时，将产生如下效果：',
              '·释放寒冰的力量，对周围的敌人施加冰元素附着；',
              '·将寒气凝聚在剑上，使神里绫华在短时间内获得冰元素附魔。',
              '<i>「滴雫濡羽瞬消无，白鹭踏水何可怨？」</i>'
            ],
            tables: [
              { name: '启动体力消耗', unit: '', isSame: true, values: ['10点'] },
              { name: '持续体力消耗', unit: '', isSame: true, values: ['每秒15点'] },
              { name: '附魔持续时间', unit: '', isSame: true, values: ['5秒'] }
            ]
          }
        ],
        version: 1,
        eta: 1626832800000
      }
    }
  },
  [
    {
      element: ElementEnum.冰,
      dmgRank: '霰步E后重击总伤害',
      calcs: [
        {
          title: '霰步E后重击总伤害',
          dmg: ({ talent }, DmgCalc) => DmgCalc.dmg(talent[DmgTalentKeysEnum.a]['重击伤害'], [DmgTalentKeysEnum.a2])
        }, {
          title: '神里流·冰华 伤害',
          dmg: ({ talent }, DmgCalc) => DmgCalc.dmg(talent[DmgTalentKeysEnum.e]['技能伤害'], [DmgTalentKeysEnum.e])
        }, {
          title: '神里流·霜灭 单段伤害',
          dmg: ({ talent }, DmgCalc) => DmgCalc.dmg(talent[DmgTalentKeysEnum.q]['切割伤害'], [DmgTalentKeysEnum.q])
        }, {
          title: '重击总伤害',
          params: { team: false },
          dmg: ({ talent }, DmgCalc) => DmgCalc.dmg(talent[DmgTalentKeysEnum.a]['重击伤害'], [DmgTalentKeysEnum.a2])
        }, {
          title: '神鹤万莫重击总伤害',
          params: { team: true },
          dmg: ({ talent }, DmgCalc) => DmgCalc.dmg(talent[DmgTalentKeysEnum.a]['重击伤害'], [DmgTalentKeysEnum.a2])
        }, {
          title: 'E伤害',
          params: { team: false },
          dmg: ({ talent }, DmgCalc) => DmgCalc.dmg(talent[DmgTalentKeysEnum.e]['技能伤害'], [DmgTalentKeysEnum.e])
        }, {
          title: 'Q单段伤害',
          params: { team: false },
          dmg: ({ talent }, DmgCalc) => DmgCalc.dmg(talent[DmgTalentKeysEnum.q]['切割伤害'], [DmgTalentKeysEnum.q])
        }, {
          title: '神鹤万莫Q单段伤害',
          params: { team: true },
          dmg: ({ talent }, DmgCalc) => DmgCalc.dmg(talent[DmgTalentKeysEnum.q]['切割伤害'], [DmgTalentKeysEnum.q])
        }
      ]
    }
  ],
  [
    {
      element: ElementEnum.冰,
      buffs: [
        {
          passive: 1,
          title: '神里被动：释放E后普攻与重击伤害提高30%',
          data: {
            aDmg: 30, a2Dmg: 30
          }
        }, {
          passive: 2,
          title: '神里被动：霰步命中敌人获得18%冰伤加成',
          data: {
            dmg: 18
          }
        }, {
          cons: 4,
          title: '神里4命：元素爆发后敌人防御力降低30%',
          data: {
            qDef: 30
          }
        }, {
          cons: 6,
          title: '神里6命：每10秒重击伤害提高[a2Dmg]%',
          data: {
            a2Dmg: 298
          }
        }, {
          check: ({ cons, params }: BuffCheckArgs) => cons <= 1 && params.team === true,
          title: '精1苍古0命万叶：获得[dmg]%增伤(苍古普攻16增伤)，增加[atkPct]%攻击,减抗[RES]%',
          data: {
            aDmg: 16, a2Dmg: 16, a3Dmg: 16, dmg: 40, atkPct: 20, RES: 40
          }
        }, {
          check: ({ cons, params }: BuffCheckArgs) => ((cons < 6 && cons > 1) && params.team === true),
          title: '精1苍古2命万叶：获得[dmg]%增伤(苍古普攻16增伤)，增加[atkPct]%攻击,减抗[RES]%,精通[mastery]',
          data: {
            aDmg: 16, a2Dmg: 16, a3Dmg: 16, dmg: 48, atkPct: 20, RES: 40, mastery: 200
          }
        }, {
          check: ({ cons, params }: BuffCheckArgs) => (cons >= 6 && params.team === true),
          title: '精5苍古6命万叶：获得[dmg]%增伤(苍古普攻32增伤)，增加[atkPct]%攻击,减抗[RES]%,精通[mastery]',
          data: {
            aDmg: 32, a2Dmg: 32, a3Dmg: 32, dmg: 48, atkPct: 40, RES: 40, mastery: 200
          }
        }, {
          check: ({ cons, params }: BuffCheckArgs) => (cons >= 6 && params.team === true),
          title: '精5息灾申鹤：获得[dmg]%增伤,减抗[RES]%,爆伤15%,双冰暴击15%，提升冰伤害5700',
          data: {
            dmg: 30, RES: 15, cdmg: 15, cpct: 15, a2Plus: 5700 * 3, ePlus: 5700, qPlus: 5700
          }
        }, {
          check: ({ cons, params }: BuffCheckArgs) => (cons < 6 && params.team === true),
          title: '精1息灾申鹤：获得[dmg]%增伤,减抗[RES]%,双冰暴击15%，提升冰伤害4300',
          data: {
            dmg: 30, RES: 15, cpct: 15, a2Plus: 4300 * 3, ePlus: 4300, qPlus: 4300
          }
        }, {
          check: ({ cons, params }: BuffCheckArgs) => (cons >= 2 && params.team === true),
          title: '千岩讨龙4命莫娜：获得[dmg]%增伤，增加[atkPct]%攻击,暴击15%',
          data: {
            dmg: 60, cpct: 15, atkPct: 68
          }
        }, {
          check: ({ cons, params }: BuffCheckArgs) => (cons < 2 && params.team === true),
          title: '千岩讨龙0命莫娜：获得[dmg]%增伤，增加[atkPct]%攻击',
          data: {
            dmg: 60, atkPct: 68
          }
        }
      ]
    }
  ],
  [
    {
      element: ElementEnum.冰,
      mainAttrs: [DmgAttrKeysEnum.atk, DmgAttrKeysEnum.cpct, DmgAttrKeysEnum.cdmg]
    }
  ]
)
